In [51]:
# linear algebra
import numpy as np 

# data processing
import pandas as pd 

# data visualization
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## Predicting the Survival of Titanic Passengers

In [52]:
test = pd.read_csv("Titanictest.csv")
train = pd.read_csv("Titanictrain.csv")

In [53]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [54]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- Above we can see that 38% out of the training-set survived the Titanic. 
- We can also see that the passenger ages range from 0.4 to 80. 
- On top of that we can already detect some features, that contain missing values, like the ‘Age’ feature.

In [55]:
train.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

-  First of all, that we need to convert a lot of features into numeric
- We can also spot some more features, that contain missing values (NaN = not a number), that wee need to deal with.

### Exploratory Data Analysis¶

In [56]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- From above we can see that Age, cabin and embarked are having missing values
- We can substitute mean values for the missing values in Age,Embarked
- For Cabin it is containing more than 70% of data is having null values,So we can remove the column

In [57]:
train['Age'].mean()

29.69911764705882

In [58]:
train['Age']=train['Age'].fillna(train['Age'].mean())

In [59]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [60]:
train['Embarked'].mode()

0    S
dtype: object

- Since the data is categorical value so we are substituting the missing value with `train['Embarked'].mode()`

In [61]:
train['Embarked']=train['Embarked'].fillna('S')

In [62]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- The column cabin is missing above 70% of data so we are dropping the column

In [63]:
train.drop('Cabin',axis=1,inplace=True)

In [64]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [65]:
train['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [66]:
train['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [67]:
trains=train

In [68]:
trains.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [69]:
trains['SibSp'].unique()

array([1, 0, 3, 4, 2, 5, 8], dtype=int64)

- Transforming the categorical data of columns Gender and Embarked to numerical columns.

In [70]:
from sklearn.preprocessing import LabelEncoder

In [71]:
le=LabelEncoder()

In [72]:
trains['Gender']=le.fit_transform(trains['Gender'])

In [73]:
trains['Embarked']=le.fit_transform(trains['Embarked'])

In [74]:
trains['Gender'].unique()

array([1, 0], dtype=int64)

In [75]:
trains.keys()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

- from the above PassengerId,Name,Ticket are the categorical data which cannot be duplicated or converted to numerical data.
- We are dropping those columns

In [76]:
trains.drop(['PassengerId','Name','Ticket'],axis=1,inplace=True)

In [77]:
trains.head()

   Survived  Pclass  Gender   Age  SibSp  Parch     Fare  Embarked
0         0       3       1  22.0      1      0   7.2500         2
1         1       1       0  38.0      1      0  71.2833         0
2         1       3       0  26.0      0      0   7.9250         2
3         1       1       0  35.0      1      0  53.1000         2
4         0       3       1  35.0      0      0   8.0500         2

## Now performing similar data-cleaning ontest-data

In [78]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Gender         418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [79]:
test['Age']=test['Age'].fillna(test['Age'].mean())

In [80]:
test['Fare'].describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [81]:
test['Fare']=test['Fare'].fillna(test['Fare'].mean())

In [82]:
tests=test

In [83]:
tests.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Gender         418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           418 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

- From the abobe we are dropping the columns Name,PassengerId,Ticket,cabin

In [85]:
tests.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [86]:
tests.head()

   PassengerId  Pclass  Gender   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [87]:
tests['Gender']=le.fit_transform(tests['Gender'])

In [88]:
tests['Embarked']=le.fit_transform(tests['Embarked'])

In [89]:
tests.head()

   PassengerId  Pclass  Gender   Age  SibSp  Parch     Fare  Embarked
0          892       3       1  34.5      0      0   7.8292         1
1          893       3       0  47.0      1      0   7.0000         2
2          894       2       1  62.0      0      0   9.6875         1
3          895       3       1  27.0      0      0   8.6625         2
4          896       3       0  22.0      1      1  12.2875         2

In [90]:
trains.head()

   Survived  Pclass  Gender   Age  SibSp  Parch     Fare  Embarked
0         0       3       1  22.0      1      0   7.2500         2
1         1       1       0  38.0      1      0  71.2833         0
2         1       3       0  26.0      0      0   7.9250         2
3         1       1       0  35.0      1      0  53.1000         2
4         0       3       1  35.0      0      0   8.0500         2

## Train and build Classifier

In [91]:
X = trains.drop('Survived',axis=1)
y = trains['Survived']

In [92]:
from sklearn.model_selection import train_test_split

In [93]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=101)

In [94]:
from sklearn.linear_model import LogisticRegression

In [95]:
logmodel = LogisticRegression()
logmodel.fit(X_train,y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [96]:
logmodel.score(X_train,y_train)

0.8170144462279294

In [97]:
logmodel.score(X_test,y_test)

0.7761194029850746

## Making Predictions

In [101]:
test_x = tests.drop('PassengerId',axis=1)

In [102]:
predictions = logmodel.predict(test_x)

In [103]:
final_prediction = pd.DataFrame({'PassengerId':test['PassengerId'],'Survived':predictions})

In [104]:
final_prediction

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

AttributeError: 'DataFrame' object has no attribute 'value_counts'